{
  "chapter": "7. Oscillations",
  "theories": [
    {
      "card_title": "Periodic Motion",
      "card_other": "Motion that repeats itself at regular intervals of time. Examples: pendulum, rotation of Earth, heartbeat, alternating current. Time for one complete cycle is period."
    },
    {
      "card_title": "Oscillatory Motion",
      "card_other": "To-and-fro motion about a mean (equilibrium) position. All oscillatory motions are periodic but not all periodic motions are oscillatory. Examples: pendulum, mass-spring system, vibrating string."
    },
    {
      "card_title": "Simple Harmonic Motion (SHM)",
      "card_other": "Special type of oscillatory motion where acceleration is directly proportional to displacement from equilibrium and always directed toward equilibrium. Sinusoidal variation with time. Restoring force proportional to displacement."
    },
    {
      "card_title": "Amplitude",
      "card_other": "Maximum displacement from mean position. Always positive. Determines energy of oscillation - energy proportional to square of amplitude. Remains constant in ideal SHM (no damping)."
    },
    {
      "card_title": "Period",
      "card_other": "Time for one complete oscillation (cycle). SI unit: second. Independent of amplitude in SHM (isochronous property). Symbol: T. Reciprocal of frequency."
    },
    {
      "card_title": "Frequency",
      "card_other": "Number of complete oscillations per unit time. SI unit: hertz (Hz) = s⁻¹ = cycles per second. Symbol: f. Reciprocal of period. Higher frequency means faster oscillation."
    },
    {
      "card_title": "Angular Frequency",
      "card_other": "Rate of change of phase angle. Related to frequency by ω = 2πf. SI unit: rad/s. More convenient than f for mathematical treatment of SHM."
    },
    {
      "card_title": "Phase",
      "card_other": "The state of oscillation at a particular instant - determines position and direction of motion. Measured in radians. Phase difference indicates how much one oscillation leads/lags another."
    },
    {
      "card_title": "Restoring Force",
      "card_other": "Force that brings oscillating body back toward equilibrium position. Always directed opposite to displacement. Proportional to displacement in SHM (Hooke's law). Essential for oscillatory motion."
    },
    {
      "card_title": "Hooke's Law",
      "card_other": "Restoring force in spring is proportional to extension/compression and opposite in direction: F = -kx. k is spring constant (stiffness). Valid for small deformations. Basis of SHM in mass-spring system."
    },
    {
      "card_title": "Spring Constant",
      "card_other": "Measure of stiffness of spring. Force required per unit extension. SI unit: N/m. Symbol: k. Larger k means stiffer spring, higher frequency of oscillation."
    },
    {
      "card_title": "Energy in SHM",
      "card_other": "Total mechanical energy remains constant. Continuous interchange between kinetic and potential. Maximum KE at mean position (PE zero). Maximum PE at extreme positions (KE zero). Total energy proportional to square of amplitude."
    },
    {
      "card_title": "Simple Pendulum",
      "card_other": "Point mass suspended by massless, inextensible string. Performs SHM for small angles (< 10°). Period depends on length and g, independent of mass and amplitude. Used in clocks."
    },
    {
      "card_title": "Mass-Spring System",
      "card_other": "Mass attached to spring oscillates with SHM when displaced. Period depends on mass and spring constant, independent of amplitude and gravity. Horizontal or vertical arrangement possible."
    },
    {
      "card_title": "Damped Oscillations",
      "card_other": "Oscillations in which amplitude gradually decreases due to dissipative forces (friction, air resistance). Energy continuously lost. Eventually motion stops. Examples: pendulum in air, car suspension."
    },
    {
      "card_title": "Free Oscillations",
      "card_other": "Oscillations of system at its natural frequency without external periodic force. Frequency determined by properties of system (mass, spring constant, length). Amplitude decreases with time due to damping."
    },
    {
      "card_title": "Forced Oscillations",
      "card_other": "Oscillations produced by external periodic driving force. System oscillates at frequency of driving force, not natural frequency. Amplitude depends on frequency and amplitude of driving force."
    },
    {
      "card_title": "Resonance",
      "card_other": "When frequency of driving force matches natural frequency of system, amplitude becomes maximum. Can be destructive (bridge collapse) or useful (radio tuning, MRI). Energy transfer most efficient at resonance."
    },
    {
      "card_title": "Natural Frequency",
      "card_other": "The frequency at which system naturally oscillates in absence of driving force. Depends on physical properties of system. Every object has characteristic natural frequency."
    }
  ]
}