{
  "chapter": "5. Circular Motion",
  "content": [
    {
      "card_title": "Radian",
      "card_other": "The angle subtended at center of circle by arc equal in length to radius. 1 radian ≈ 57.3°. 2π radians = 360°. Dimensionless unit but written as 'rad' for clarity."
    },
    {
      "card_title": "Angular Displacement",
      "card_other": "The angle through which a point or line has been rotated in a specified direction about a specified axis. Vector quantity directed along rotation axis. SI unit: radian."
    },
    {
      "card_title": "Angular Velocity",
      "card_other": "Rate of change of angular displacement. Vector quantity along axis of rotation. Direction given by right-hand rule. SI unit: rad/s. Related to linear velocity by v = rω."
    },
    {
      "card_title": "Angular Acceleration",
      "card_other": "Rate of change of angular velocity. Vector quantity. SI unit: rad/s². Related to tangential acceleration by at = rα."
    },
    {
      "card_title": "Uniform Circular Motion",
      "card_other": "Motion in circle with constant speed. Velocity continuously changes direction. Acceleration always directed toward center (centripetal). No tangential acceleration. Speed constant but velocity not constant."
    },
    {
      "card_title": "Centripetal Acceleration",
      "card_other": "Acceleration directed toward center of circular path. Required to keep object moving in circle. Perpendicular to velocity at every instant. Causes change in direction, not speed."
    },
    {
      "card_title": "Centripetal Force",
      "card_other": "Net force directed toward center that keeps object in circular motion. Not a new type of force - can be tension, gravity, friction, normal force, etc. If removed, object moves in straight line (tangent to circle)."
    },
    {
      "card_title": "Centrifugal Force",
      "card_other": "Apparent outward force experienced in rotating reference frame. Pseudo force (fictitious) - exists only in non-inertial (accelerating) frames. Not a real force; result of inertia of body."
    },
    {
      "card_title": "Banking of Roads",
      "card_other": "Raising outer edge of curved road above inner edge. Provides centripetal force component from normal reaction. Reduces dependence on friction. Optimal angle depends on speed and radius of curve."
    },
    {
      "card_title": "Conical Pendulum",
      "card_other": "A pendulum bob moving in horizontal circle with string tracing cone. Tension provides both vertical support (against weight) and horizontal centripetal force. Period independent of mass of bob."
    },
    {
      "card_title": "Moment of Inertia",
      "card_other": "Rotational analog of mass. Resistance to change in rotational motion. Depends on mass distribution relative to axis of rotation. SI unit: kg·m². Symbol: I. Larger for mass farther from axis."
    },
    {
      "card_title": "Torque",
      "card_other": "Turning effect of force about an axis. Vector quantity perpendicular to plane of force and radius. Maximum when force is perpendicular to radius. Zero when force passes through axis or parallel to radius vector."
    },
    {
      "card_title": "Angular Momentum",
      "card_other": "Rotational analog of linear momentum. Product of moment of inertia and angular velocity (L = Iω). Vector along rotation axis. Conserved in absence of external torque."
    },
    {
      "card_title": "Law of Conservation of Angular Momentum",
      "card_other": "If net external torque is zero, angular momentum remains constant. Explains why ice skater spins faster when arms pulled in (I decreases, ω increases to keep L constant)."
    },
    {
      "card_title": "Rotational Kinetic Energy",
      "card_other": "Energy due to rotation. Depends on moment of inertia and angular velocity. For rolling motion, total KE = translational KE + rotational KE."
    },
    {
      "card_title": "Rolling Motion",
      "card_other": "Combination of translation and rotation. Point of contact with ground momentarily at rest (no slipping). Velocity of top point is twice velocity of center of mass."
    },
    {
      "card_title": "Simple Pendulum",
      "card_other": "A point mass suspended by massless, inextensible string. Performs SHM for small angles (< 10°). Period depends on length and g, independent of mass and amplitude (for small angles)."
    },
    {
      "card_title": "Satellite Motion",
      "card_other": "Gravitational force provides centripetal force for circular orbit. Orbital velocity depends on radius of orbit and mass of planet. Satellites closer to planet orbit faster."
    },
    {
      "card_title": "Geostationary Satellite",
      "card_other": "Satellite that appears stationary relative to Earth's surface. Period of 24 hours. Must orbit above equator at specific altitude (~36,000 km). Used for communication and weather monitoring."
    }
  ]
}